# All about Feature Transformation Techniques

In [1]:
import pandas as pd
import seaborn as sns

In [2]:
df = pd.read_csv('supershops.csv')
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

# MinMaxScaler / Normalization

In [3]:
#MinMaxScaler / Normalization
from sklearn.preprocessing import MinMaxScaler

In [4]:
mmx = MinMaxScaler(feature_range=(0, 1)) #creationg obj for min max scaler

In [5]:
ms_fit = mmx.fit(df[['Marketing Spend']]) #fit / train
ms_fit

MinMaxScaler()

In [6]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [7]:
df['Marketing Spend'] = mmx.transform(df[['Marketing Spend']]) # transform the data
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617       136897.80  471784.10    Dhaka  192261.83
1         0.983359       151377.59  443898.53      Ctg  191792.06
2         0.927985       101145.55  407934.54  Rangpur  191050.39
3         0.873136       118671.85  383199.62    Dhaka  182901.99
4         0.859438        91391.77  366168.42  Rangpur  166187.94

In [8]:
#at a time fit and transform
df['Administration'] = mmx.fit_transform(df[['Administration']])
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744  471784.10    Dhaka  192261.83
1         0.983359        0.761972  443898.53      Ctg  191792.06
2         0.927985        0.379579  407934.54  Rangpur  191050.39
3         0.873136        0.512998  383199.62    Dhaka  182901.99
4         0.859438        0.305328  366168.42  Rangpur  166187.94

In [9]:
mmx2 = MinMaxScaler(feature_range=(3, 5)) #creationg obj for min max scaler

In [10]:
#at a time fit and transform
df['Transport'] = mmx2.fit_transform(df[['Transport']])
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744   5.000000    Dhaka  192261.83
1         0.983359        0.761972   4.881787      Ctg  191792.06
2         0.927985        0.379579   4.729327  Rangpur  191050.39
3         0.873136        0.512998   4.624470    Dhaka  182901.99
4         0.859438        0.305328   4.552271  Rangpur  166187.94

# Standard Scaler

In [ ]:
df2 = pd.read_csv('supershops.csv')
df2.head()

In [13]:
#Standard Scaler
from sklearn.preprocessing import StandardScaler

# Robust Scaler

In [ ]:
from sklearn.preprocessing import RobustScaler

# Max Absolute Scaler

In [ ]:
from sklearn.preprocessing import MaxAbsScaler

# Normal Techniques

In [14]:
df5 = pd.read_csv('supershops.csv')
df5.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [17]:
maximum = df5.Administration.max()
maximum

182645.56

In [18]:
 df5.Administration =  df5.Administration / maximum

In [19]:
df5.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61        0.749527  471784.10    Dhaka  192261.83
1        162597.70        0.828805  443898.53      Ctg  191792.06
2        153441.51        0.553781  407934.54  Rangpur  191050.39
3        144372.41        0.649738  383199.62    Dhaka  182901.99
4        142107.34        0.500378  366168.42  Rangpur  166187.94

In [20]:
df5.Administration.std()

0.15339985683467303

In [21]:
 df5.Administration.var()

0.02353151607689818

In [22]:
 df5.Administration.mean()

0.6643722387776632

In [23]:
 df5.Administration.median()

0.6717918300340835

In [24]:
 df5.Administration.max()

1.0

In [25]:
 df5.Administration.min()

0.2807795601491764